insert into status values 
( 'Больничный'),
( 'Работает'),
('Отпуск'),
('Декрет'),
('Уволен');


insert into deps values
('Продажи'),
('Бухгалтерия'),
('Разработка'),
('Производство'),
('Менеджмент');

insert into posts values
('Менеджер'),
('Бухгалтер'),
('Разработчик'),
('Механик'),
('Токарь'),
('Конструктор');


insert into persons values
('Елизар', 'Константинович', 'Ушаков', '2020.24.12', NULL, 2, 3, 3),
('Макар', 'Андрееевич', 'Аверин', '2021.01.02', NULL, 2, 3, 3),
('Власта', 'Аркадьевна', 'Дубинина', '2021.14.01', NULL, 2, 3, 3),
('Иосиф', 'Дмитриевич', 'Бердинских', '2020.09.11', NULL, 2, 2, 2),
('Панкрат', 'Антонович', 'Румянцев', '2020.29.08', '2021.14.03', 5, 6 ,4),
('Денис', 'Леонидович', 'Ильин', '2020.12.12', NULL, 2, 5, 4),
('Элла', 'Дмитриевна', 'Бердинских', '2020.11.11', NULL, 1, 5 ,4),
('Виталий', 'Вениаминович', 'Игнатов', '2021.16.01', NULL, 2, 1, 5),
('Стела', 'Максимовна', 'Мозговых', '2020.04.01', NULL, 2, 1, 5),
('Роберт', 'Анатольевич', 'Сысолятин', '2020.14.03', '2021.10.03', 5, 4, 4),
('Клеопатра', 'Леонидовна', 'Волочкова', NULL, NULL, 3, 5, 4),
('Руслан', 'Борисович', 'Вершинин', '2020.18.03', NULL, 3, 5, 4),
('Добромысл', 'Максимович', 'Лучной', '2020.15.10', '2021.01.03', 5, 3, 3),
('Демид', 'Геннадиевич', 'Архипов', '2021.03.01', NULL, 2, 2, 2),
('Рогнеда', 'Робертовна', 'Жданова', '2021.28.02', NULl, 4, 2, 2),
('Гавриил', 'Эльдарович', 'Пугачев', NULL, NULL, 1, 4, 4),
('Элина', 'Семеновна', 'Васютина', '2020.14.12', '2020.25.03', 4, 4 ,4);



